{
  "id": "01",
  "privateCase": true,
  "caseType": "case",
  "slug": "optimizing-manual-stock-counting-process-privateCase-21012025",
  "title": "Optimizing the Manual Stock Counting Process",
  "subtitle": "Stock and supply counting is an essential activity in restaurant kitchens. Our solution revolutionizes this process by centralizing inventory management, replacing paper, pen, and spreadsheets with technology. Now, counting is done in a practical and accurate manner using QR codes on labels, ensuring a more efficient, modern operation fully integrated into the daily kitchen workflow.",
  "company": "Suflex",
  "myrole": "As a Product Designer, I led the entire research and data analysis process, identifying key barriers in user experience. I created solution prototypes, conducted usability testing, and analyzed metrics to validate the implemented improvements. I worked closely with product and development teams to ensure that the changes were effective, always focusing on enhancing the mobile experience and reducing abandonment rates during skill tests.",
  "timeFrame": "2 weeks (2023)",
  "plataform": "Web (Desktop, Tablet & Mobile)",
  "researchMethods": "Double Diamond: Understand abandonment rates; Define the problem, metrics, and how it will be measured; Develop a solution; Delivery (Test and refinement).",
  "tools": "Miro, Notion, Hotjar, Google Analytics, Figma, Maze.",
  "teamStructure": "Product: Ramon Sousa (PD), Leo Coitim (PM), Developers, QA, and Stakeholders",
  "publishedAt": [
    "2024"
  ],
  "thumbnail": "/assets/cases/suflex-contagem/cover-test-2025.png",
  "banner": "/assets/cases/suflex-contagem/banner-highlights.png",
  "bannerHighlight": "/assets/cases/suflex-contagem/before-after.png",
  "tags": [
    "Service Blueprint",
    "Mobile",
    "Benchmark"
  ],
  "problemName": "Contexo",
  "problemCaption": "The company was facing challenges in reaching breakeven and expanding its market share. However, there was a lack of clarity about which paths to explore to achieve these goals. Our objective was to identify recurring pain points in restaurant management and operations and explore product solutions that could address these needs effectively.",
  "goals": [
    "Increase the number of mobile app downloads.",
    "Reduce abandonment rate in started tests.",
    "Improve the user experience in tests."
  ],
  "description": {
    "paragraph": {
      "descTitle": "Research and Data Collection",
      "descText": "Using tools like Hotjar and Google Analytics, we analyzed user behavior and identified the main barriers. We observed high abandonment rates in skill tests, especially for mobile users.",
      "descImage": "/assets/cases/suflex-contagem/insights.png",
      "imageCaption": "Interviews with users and heatmap analysis helped map friction points and navigability issues."
    },
    "paragraph-2": {
      "descTitle": "Relevant Persona",
      "descText": "The 'Applicators' persona was the most relevant for business goals, representing a large part of our user base. They played a crucial role in future platform monetization strategies and became essential to the product's growth towards achieving breakeven.",
      "descImage": "/assets/cases/suflex-contagem/personas.png",
      "imageCaption": ""
    },
    "paragraph-3": {
      "descTitle": "Performance Indicator",
      "descText": "I analyzed how often users accessed the Construction Partner in periods before improvements in skill tests. I also evaluated whether there was an increase in certificate issuance after the introduction of these tests.",
      "descImage": "/assets/cases/suflex-contagem/perfomance.png",
      "imageCaption": "Data from the period before the discovery process."
    },
    "paragraph-4": {
      "descTitle": "Test Scenarios",
      "descText": "For usability testing, I developed wireframes that addressed key tasks users should perform. The test script included actions such as finding the new course page, locating ongoing tests, navigating between available categories, and reporting an error in a specific question. Users were also encouraged to evaluate the relevance of the 'Challenges' proposed and share their results upon completing a test.",
      "descImage": "/assets/cases/suflex-contagem/wireframe.png",
      "imageCaption": "Wireframe used in the first usability test. It's important to note the 'Tabs' navigation, which was discarded after the test (This was also replicated in other flows being developed simultaneously)."
    },
    "paragraph-5": {
      "descTitle": "Usability Testing",
      "descText": "I conducted two versions of usability tests. In the first version, a group of five users, representing the defined personas, faced difficulties in various steps of the test. Based on this feedback, I implemented improvements and conducted a new test, involving both new users and some participants from the first version.",
      "descImage": "/assets/cases/suflex-contagem/persona-usabillity-test.png",
      "imageCaption": "Key insights collected after conducting the usability test with the 'Applicator' persona users."
    },
    "paragraph-6": {
      "descTitle": "High Fidelity and Handoff",
      "descText": "After validating wireframes and usability tests, I developed high-fidelity screens in Figma, ensuring a more refined visual experience aligned with the platform's design system. I then handed off the designs to the developers, documenting the components, spacings, colors, and interactive behaviors in detail.",
      "descImage": "/assets/cases/suflex-contagem/high-fidelity.png",
      "imageCaption": "High-fidelity screens, already incorporating a rebrand done in parallel by the marketing team during the project execution."
    }
  },
  "resultName": "Results",
  "resultCaption": "I used tools like Google Analytics and Hotjar to monitor platform performance over a three-month period.",
  "results": {
    "outcome": {
      "resultIcon": "<BadgeCheck />",
      "resultTitle": "+18%",
      "resultDesc": "We observed an 18% increase in the number of users completing skill tests, rising from 1,586 to 1,871 monthly completions."
    },
    "outcome-2": {
      "resultIcon": "<TabletSmartphone />",
      "resultTitle": "+23%",
      "resultDesc": "The app recorded a 23% growth in downloads, increasing from 871 to 1,071 new users in the quarter after implementation."
    },
    "outcome-3": {
      "resultIcon": "<CircleArrowOutDownRight />",
      "resultTitle": "-13%",
      "resultDesc": "The abandonment rate during skill test execution decreased by 13%, from 7.38% to 6.42%."
    }
  }
}