{
  "id": "01",
  "privateCase": true,
  "caseType": "case",
  "slug": "optimizing-manual-stock-counting-process-privateCase-21012025",
  "title": {
    "en": "Optimizing the Manual Stock Counting Process",
    "pt-br": "Otimizando o Processo Manual de Contagem de Estoque"
  },
  "subtitle": {
    "en": "Stock and supply counting is an essential activity in restaurant kitchens. Our solution revolutionizes this process by centralizing inventory management, replacing paper, pen, and spreadsheets with technology. Now, counting is done in a practical and accurate manner using QR codes on labels, ensuring a more efficient, modern operation fully integrated into the daily kitchen workflow.",
    "pt-br": "A contagem de estoque e insumos é uma atividade essencial em cozinhas de restaurantes. Nossa solução revoluciona esse processo centralizando o gerenciamento de inventário, substituindo papel, caneta e planilhas por tecnologia. Agora, a contagem é feita de maneira prática e precisa usando QR codes em etiquetas, garantindo uma operação mais eficiente, moderna e totalmente integrada ao fluxo de trabalho diário da cozinha."
  },
  "company": "Suflex",
  "myrole": "As a Product Designer, I was responsible for leading the entire research process, where I was able to map the user journey, identifying the main barriers in the user experience. I wrote research scripts for in-person user interviews. Later, I created prototypes, performed usability tests, and defined metrics to validate the improvements made.",
  "timeFrame": "2023 - 2024 | Web (Desktop, Tablet & Mobile)",
  "plataform": "Web (Desktop, Tablet & Mobile)",
  "researchMethods": "Double Diamond: Understand abandonment rates; Define the problem, metrics, and how it will be measured; Develop a solution; Delivery (Test and refinement).",
  "tools": "Miro, Notion, Hotjar, Google Analytics, Figma, Maze.",
  "teamStructure": "Product: Ramon Sousa (PD), Leo Coitim (PM), Developers, QA, and Stakeholders",
  "publishedAt": [
    "2024"
  ],
  "thumbnail": "/assets/cases/suflex-contagem/cover-test-2025.png",
  "banner": "/assets/cases/suflex-contagem/banner-highlights.png",
  "bannerHighlight": "/assets/cases/suflex-contagem/before-after.png",
  "tags": [
    "SaaS",
    "Foodtech",
    "B2B/B2C"
  ],
  "problemCaption": "Goal:Identify recurring pain points in restaurant management and operations, and explore, as a product team, solutions that can effectively address these needs.",
  "problemName": "Research steps",
  "goals": [
    "Conduct a CSD Matrix to build the research script",
    "Semistructured interview for data collection.",
    "Development of a service blueprint for user validation.",
    "Creation of a storyboard.",
    "Blueprint validation interview"
  ],
  "description": {
    "paragraph": {
      "descTitle": "Research and Data Collection",
      "descText": "After CSD Matrix, we conducted the research with 6 restaurant owners, our goal was to map the restaurant's routine and identify points where we could help.",
      "descImage": "/assets/cases/suflex-contagem/paragraph-01.png",
      "imageCaption": "Interview answers has been blurred to preserve confidential informations."
    },
    "paragraph-2": {
      "descTitle": "After first research",
      "descText": "During the research phase, we identified several recurring pain points among the interviewees, including a lack of control over inventory due to reliance on manual processes, high employee turnover coupled with challenges in training and production planning, the complexity of managing work schedules and supplier communication, and an overdependence on Excel, highlighting the pressing need for automation to improve efficiency and accuracy.",
      "descImage": "/assets/cases/suflex-contagem/paragraph-02.png",
      "imageCaption": "The manual process of counting stock."
    },
    "paragraph-3": {
      "descTitle": "Mapping the Service Blueprint:",
      "descText": "After completing the initial interviews, we began mapping the operational journey within the restaurant. Our goal was to clearly understand who was responsible for each stage, identify competitors, as well as capture emotions, questions, and potential areas where the product could provide value.",
      "descImage": "/assets/cases/suflex-contagem/paragraph-03.png",
      "imageCaption": "Sketch from service blueprint"
    },
    "paragraph-4": {
      "descTitle": "Kitchen journey mapped",
      "descText": "After validating the service blueprint with new interviewees, we gained a clear understanding of the key stages of this journey and the main pain points in restaurant operations. Our next step was to validate which stages would be the most effective for us to address.",
      "descImage": "/assets/cases/suflex-contagem/paragraph-04.png",
      "imageCaption": "Kitchen journey"
    },
    "paragraph-5": {
      "descTitle": "Challenges Encountered",
      "descText": "Once we determined that the Stock Counting stage would be prioritized, we outlined the primary objectives our solution needed to achieve: eliminating manual processes for stock counting, ensuring frequent usage of the feature by our users, and eliminating errors caused by duplicate product counts.",
      "descImage": "/assets/cases/suflex-contagem/paragraph-05.png",
      "imageCaption": "The implementation of this functionality proved to require more effort than initially anticipated."
    },
    "paragraph-6": {
      "descTitle": "Proposed Solution",
      "descText": "A QR Code was added to the product control label, opening up a wide range of possibilities for exploration as a Product feature. The label became a control point, enabling traceability of supplies, reducing errors from manual processes, and unlocking other potential functionalities.",
      "descImage": "/assets/cases/suflex-contagem/paragraph-06.png",
      "imageCaption": "On the left, the screen for QR Code scanning used in stock counting; on the right, the new label structure featuring the QR Code."
    }
  },
  "resultName": "Results",
  "resultCaption": "I used tools like Google Analytics and Hotjar to monitor platform performance over a twoo-month period.",
  "results": {
    "outcome": {
      "resultIcon": "<Repeat2 />",
      "resultTitle": "+94%",
      "resultDesc": "After the launch, we observed that approximately 94% of users returned to the app to use the feature again after their first experience, demonstrating a high initial engagement rate."
    },
    "outcome-2": {
      "resultIcon": "<Clock12 />",
      "resultTitle": "2:23",
      "resultDesc": "The average session time recorded was 2 minutes and 23 seconds. By analyzing usage recordings, we noticed that many users completed one counting process and immediately started another, suggesting they were counting different physical areas within their operations, such as distinct sections of a restaurant or kitchen."
    },
    "outcome-3": {
      "resultIcon": "<CircleArrowOutDownRight />",
      "resultTitle": "14.3%",
      "resultDesc": "Despite this high initial engagement, we identified an abandonment rate that, although expected during the first months of experimentation, could be reduced. One of the main contributing factors was the warning modal displayed when scanning an already registered label. In some cases, this alert interrupted the user's journey, making the experience less seamless."
    }
  }
}