{
  "id": "02",
  "privateCase": true,
  "slug": "controle-financeiro-whatsapp-privateCase-20251255",
  "title": "Controle financeiro integrado com WhatsApp",
  "subtitle": "Plataforma que permite gerenciar finanças pessoais ou empresariais diretamente pelo WhatsApp, oferecendo uma maneira prática de controlar entradas, saídas e gerar relatórios financeiros.",
  "company": "Freelancer",
  "myrole": "Como Product Designer, fui responsável por liderar todo o processo de pesquisa e análise de dados, identificando as principais barreiras na experiência dos usuários. Criei protótipos de soluções, conduzi testes de usabilidade, e analisei métricas para validar as melhorias implementadas. Trabalhei em estreita colaboração com as equipes de produto e desenvolvimento para garantir que as mudanças fossem eficazes, sempre mantendo o foco em aprimorar a experiência mobile e reduzir as taxas de abandono nos testes de habilidade.",
  "timeFrame": "2 semanas (2022)",
  "plataform": "App (Android e IOS)",
  "researchMethods": "Double Diamond Entender as taxas de abandono; Definir o problema, métricas e como será medido; Desenvolver uma solução; Entrega (Teste e refinamento).",
  "tools": "Miro, Notion, Hotjar, Google analitycs, Figma, Maze.",
  "teamStructure": "Produto: Ramon Sousa(PD) e Lais Sousa(PM), Desenvolvedores: Vinicius Bassalobre e Jessé",
  "publishedAt": [
    "2024"
  ],
  "thumbnail": "/assets/cases/moneymio/cover-moneymio.png",
  "banner":  "/assets/cases/suflex-contagem/banner-highlights.png",
  "bannerHighlight":  "/assets/cases/suflex-contagem/before-after.png",
  "tags": [
    "Service Blueprint",
    "Mobile",
    "Benchmark"
  ],
  "problemName": "Motivações",
  "problemCaption": "Problem Statement: Apesar dos inúmeros problemas de usabilidade identificados na plataforma, nossos usuários demonstravam um valor significativo nos testes de habilidade, evidenciado pelas altas taxas de conclusão e pelos frequentes acessos ao fluxo. No entanto, as dificuldades enfrentadas durante a navegação comprometiam a experiência geral e levavam o usuário a se desengajar da plataforma.",
  "goals": [
    "Aumentar o número de downloads do aplicativo mobile.",
    "Reduzir taxa de abandono em testes iniciados.",
    "Melhorar a experiência de uso nos testes."
  ],
  "description": {
    "paragraph": {
      "descTitle": "Pesquisa e coleta de dados",
      "descText": "Utilizando ferramentas como Hotjar e Google Analytics, analisamos o comportamento dos usuários e identificamos as principais barreiras. Observamos altas taxas de abandono nos testes de habilidade, especialmente para os usuários mobile.",
      "descImage": "/assets/cases/suflex-contagem/insights.png",
      "imageCaption": "Entrevistas com usuários e análise de heatmaps ajudaram a mapear pontos de fricção e problemas de navegabilidade."
    },
    "paragraph-2": {
      "descTitle": "Persona relevante",
      "descText": "A persona 'Aplicadores' foi a mais relevante para os objetivos de negócio, pois representou uma grande parte da nossa base de usuários. Eles desempenharam um papel crucial nas futuras estratégias de monetização da plataforma, tornando-se fundamentais para o crescimento do produto até a obtenção do Breakeven.",
      "descImage": "/assets/cases/suflex-contagem/personas.png",
      "imageCaption": ""
    },
    "paragraph-3": {
      "descTitle": "Performance indicator",
      "descText": "Analisei a frequência com que os usuários acessaram o Parceiro da Construção em períodos anteriores as melhorias nos testes de habilidade. Além disso, avaliei se houve um aumento na emissão de certificados após a introdução desses testes.",
      "descImage": "/assets/cases/suflex-contagem/perfomance.png",
      "imageCaption": "Dados referentes ao periodo anterior ao processo de discovery."
    },
    "paragraph-4": {
      "descTitle": "Wireframe e cenário de teste",
      "descText": "Para os testes de usabilidade, desenvolvi wireframes que contemplavam as principais tarefas que os usuários deveriam realizar. O roteiro incluía ações como encontrar a nova página de cursos, localizar os testes em andamento, navegar entre as categorias disponíveis, e reportar um erro em uma questão específica. Além disso, os usuários foram incentivados a avaliar a relevância dos “Desafios” propostos e, ao final, compartilhar seus resultados após a conclusão de um teste.",
      "descImage": "/assets/cases/suflex-contagem/wireframe.png",
      "imageCaption": "Wireframe utilizado no primeiro teste de usabilidade, é válido ressaltar a navegação por 'Tabs'que foi descartada após o teste (O mesmo pode ser replicado em outros fluxos que estavam em desenvolvimento em simultâneo."
    },
    "paragraph-5": {
      "descTitle": "Testes de usabilidade",
      "descText": "Realizei duas versões de testes de usabilidade. Na primeira versão, um grupo de cinco usuários, representando as personas definidas, os usuários encontraram dificuldades em diversas etapas do teste. Com base nesse feedback, implementei melhorias e conduzi um novo teste, envolvendo tanto novos usuários quanto alguns dos participantes da primeira versão. ",
      "descImage": "/assets/cases/suflex-contagem/persona-usabillity-test.png",
      "imageCaption": "Principais insights coletados após a realização do teste de usabilidade com usuários da persona 'Aplicador'."
    },
    "paragraph-6": {
      "descTitle": "Alta fidelidade e handoff",
      "descText": "Após a validação dos wireframes e testes de usabilidade, desenvolvi as telas em alta fidelidade no Figma, garantindo uma experiência visual mais refinada e alinhada ao design system da plataforma. Em seguida, realizei o handoff para os desenvolvedores, documentando detalhadamente os componentes, espaçamentos, cores e comportamentos interativos.",
      "descImage": "/assets/cases/suflex-contagem/high-fidelity.png",
      "imageCaption": "Telas em alta fidelidade, já contemplando um rebrand realizado em paralelo pelo time de marketing durante a execução do projeto."
    }
  },
  "resultName": "Resultados",
  "resultCaption": "Utilizei ferramentas como Google Analytics e Hotjar para monitorar o desempenho da plataforma durante um trimestre.",
  "results": {
    "outcome": {
      "resultIcon": "<BadgeCheck />",
      "resultTitle": "+18%",
      "resultDesc": "Observamos um aumento de 18% no número de usuários que completaram os testes de habilidade, passando de 1.586 para 1.871 finalizações mensais."
    },
    "outcome-2": {
      "resultIcon": "<TabletSmartphone />",
      "resultTitle": "+23%",
      "resultDesc": "O aplicativo registrou um crescimento de 23% nos downloads, subindo de 871 para 1.071 novos usuários no trismestre após a implementação."
    },
    "outcome-3": {
      "resultIcon": "<CircleArrowOutDownRight />",
      "resultTitle": "-13%",
      "resultDesc": "A taxa de abandono durante a execução dos testes de habilidade diminuiu em 13%, passando de 7.38% para 6.42%."
    }
  }

}