{
  "id": "03",
  "privateCase": true,
  "slug": "genesi-lab",
  "title": "Genesi medicina laboratorial",
  "subtitle": "O projeto realizado teve como foco aprimorar a experiência do usuário para a Genesi Medicina Laboratorial, uma empresa que se destaca na oferta de serviços diagnósticos acessíveis e de alta qualidade. A iniciativa envolveu a criação de soluções digitais centradas no usuário, alinhadas aos valores da empresa: respeito, responsabilidade, segurança e confiança.",
  "company": "Freelancer",
  "myrole": "Como UX/UI Designer, fui responsável por conduzir o processo de pesquisa e análise de dados, afim de construir um site institucional para promover o laboratório Genesi. Realizei reuniões com stakeholders, estruturei um benchmark, criei protótipos de soluções e defini métricas para futuras melhorias do projeto.",
  "timeFrame": "2 semanas (2022)",
  "plataform": "Web (Desktop and mobile)",
  "researchMethods": "Deskresearch e benchmark",
  "tools": "Meet, Hotjar, Figma, Maze.",
  "teamStructure": "Ramon Sousa (UX), Diogo Barros (DEV)",
  "publishedAt": [
    "2022"
  ],
  "thumbnail": "/assets/cases/genesi-lab/cover-genesi.png",
  "banner":  "/assets/cases/suflex-contagem/banner-highlights.png",
  "bannerHighlight":  "/assets/cases/suflex-contagem/before-after.png",
  "tags": [
    "Service Blueprint",
    "Mobile",
    "Benchmark"
  ],
  "problemName": "Motivações",
  "problemCaption": "Problem Statement: Pacientes enfrentam desafios no acesso a serviços de exames realizados no laboratório. Além disso, a ausência de um site, traz limitações nas formas de investimento para marketing e aquisição de novos clientes. No geral, a experiência dos usuários ainda apresenta lacunas, como dificuldade em acessar informações, navegar pelas etapas do atendimento e estabelecer confiança imediata nos serviços.",
  "goals": [
    "Criar um site como forma de promover o laboratório e aumentar a visibildade através de mecanismos de busca.",
    "Permitir que pacientes acessem seus exames através do site.",
    "Fornecer informações sobre convênios e exames realizados no laboratório."
  ],
  "description": {
    "paragraph": {
      "descTitle": "Pesquisa e coleta de dados",
      "descText": "Utilizando ferramentas como Hotjar e Google Analytics, analisamos o comportamento dos usuários e identificamos as principais barreiras. Observamos altas taxas de abandono nos testes de habilidade, especialmente para os usuários mobile.",
      "descImage": "/assets/cases/suflex-contagem/insights.png",
      "imageCaption": "Entrevistas com usuários e análise de heatmaps ajudaram a mapear pontos de fricção e problemas de navegabilidade."
    },
    "paragraph-2": {
      "descTitle": "Persona relevante",
      "descText": "A persona 'Aplicadores' foi a mais relevante para os objetivos de negócio, pois representou uma grande parte da nossa base de usuários. Eles desempenharam um papel crucial nas futuras estratégias de monetização da plataforma, tornando-se fundamentais para o crescimento do produto até a obtenção do Breakeven.",
      "descImage": "/assets/cases/suflex-contagem/personas.png",
      "imageCaption": ""
    },
    "paragraph-3": {
      "descTitle": "Performance indicator",
      "descText": "Analisei a frequência com que os usuários acessaram o Parceiro da Construção em períodos anteriores as melhorias nos testes de habilidade. Além disso, avaliei se houve um aumento na emissão de certificados após a introdução desses testes.",
      "descImage": "/assets/cases/suflex-contagem/perfomance.png",
      "imageCaption": "Dados referentes ao periodo anterior ao processo de discovery."
    }
  },
  "resultName": "Resultados",
  "resultCaption": "Utilizei ferramentas como Google Analytics e Hotjar para monitorar o desempenho da plataforma durante um trimestre.",
  "results": {
    "outcome": {
      "resultIcon": "<BadgeCheck />",
      "resultTitle": "+18%",
      "resultDesc": "Observamos um aumento de 18% no número de usuários que completaram os testes de habilidade, passando de 1.586 para 1.871 finalizações mensais."
    },
    "outcome-2": {
      "resultIcon": "<TabletSmartphone />",
      "resultTitle": "+23%",
      "resultDesc": "O aplicativo registrou um crescimento de 23% nos downloads, subindo de 871 para 1.071 novos usuários no trismestre após a implementação."
    },
    "outcome-3": {
      "resultIcon": "<CircleArrowOutDownRight />",
      "resultTitle": "-13%",
      "resultDesc": "A taxa de abandono durante a execução dos testes de habilidade diminuiu em 13%, passando de 7.38% para 6.42%."
    }
  }

}