{
  "id": "05",
  "privateCase": true,
  "caseType": "case",
  "slug": "optimization-learning-platform-partner-construction-privateCase-23101652",
  "title": "Optimization of the Partner Construction Learning Platform",
  "subtitle": "An online learning platform focused on civil construction, optimized to offer interactive and accessible technical courses and training.",
  "company": "Diwe",
  "myrole": "As a Product Designer, I was responsible for leading the entire research and data analysis process, identifying key barriers in the user experience. I created solution prototypes, conducted usability tests, and analyzed metrics to validate the improvements implemented. I worked closely with the product and development teams to ensure the changes were effective, always focusing on improving the mobile experience and reducing abandonment rates in usability tests.",
  "timeFrame": "2 weeks (2022)",
  "plataform": "App (Android and iOS)",
  "researchMethods": "Double Diamond: Understand abandonment rates; Define the problem, metrics, and how they will be measured; Develop a solution; Delivery (Testing and refinement).",
  "tools": "Miro, Notion, Hotjar, Google Analytics, Figma, Maze.",
  "teamStructure": "Product: Ramon Sousa (PD) and Lais Sousa (PM), Developers: Vinicius Bassalobre and Jessé",
  "publishedAt": [
    "2023"
  ],
  "thumbnail": "/assets/cases/pdc-exame/cover-pdc.png",
  "banner": "/assets/cases/suflex-contagem/banner-highlights.png",
  "bannerHighlight": "/assets/cases/suflex-contagem/before-after.png",
  "tags": [
    "Service Blueprint",
    "Mobile",
    "Benchmark"
  ],
  "problemName": "Motivations",
  "problemCaption": "Problem Statement: Despite the numerous usability issues identified on the platform, our users showed significant value in the skill tests, evidenced by high completion rates and frequent access to the flow. However, the difficulties encountered during navigation compromised the overall experience and led to user disengagement from the platform.",
  "goals": [
    "Increase mobile app downloads.",
    "Reduce abandonment rates in tests.",
    "Improve the user experience in the tests."
  ],
  "description": {
    "paragraph": {
      "descTitle": "Research and Data Collection",
      "descText": "Using tools like Hotjar and Google Analytics, we analyzed user behavior and identified key barriers. We observed high abandonment rates in the skill tests, especially for mobile users.",
      "descImage": "/assets/cases/suflex-contagem/insights.png",
      "imageCaption": "User interviews and heatmap analysis helped map friction points and navigation issues."
    },
    "paragraph-2": {
      "descTitle": "Relevant Persona",
      "descText": "The 'Applicators' persona was the most relevant for business objectives, as it represented a large portion of our user base. They played a crucial role in the platform's future monetization strategies, becoming essential for product growth until reaching Breakeven.",
      "descImage": "/assets/cases/suflex-contagem/personas.png",
      "imageCaption": ""
    },
    "paragraph-3": {
      "descTitle": "Performance Indicator",
      "descText": "I analyzed the frequency with which users accessed the Partner Construction platform prior to improvements in the skill tests. Additionally, I assessed if there was an increase in certificate issuance after the introduction of these tests.",
      "descImage": "/assets/cases/suflex-contagem/perfomance.png",
      "imageCaption": "Data from the period before the discovery process."
    },
    "paragraph-4": {
      "descTitle": "Wireframe and Testing Scenario",
      "descText": "For usability testing, I developed wireframes that covered the key tasks users needed to perform. The script included actions such as finding the new course page, locating ongoing tests, navigating between available categories, and reporting an error in a specific question. Users were also encouraged to assess the relevance of the proposed 'Challenges' and, at the end, share their results after completing a test.",
      "descImage": "/assets/cases/suflex-contagem/wireframe.png",
      "imageCaption": "Wireframe used in the first usability test; it's worth noting the 'Tabs' navigation, which was discarded after the test (it could also be replicated in other flows that were being developed simultaneously)."
    },
    "paragraph-5": {
      "descTitle": "Usability Testing",
      "descText": "I conducted two versions of usability tests. In the first version, a group of five users representing the defined personas encountered difficulties in several steps of the test. Based on this feedback, I implemented improvements and conducted a second test, involving both new users and some of the participants from the first version.",
      "descImage": "/assets/cases/suflex-contagem/persona-usabillity-test.png",
      "imageCaption": "Key insights gathered after conducting usability testing with users from the 'Applicator' persona."
    },
    "paragraph-6": {
      "descTitle": "High Fidelity and Handoff",
      "descText": "After validating the wireframes and usability tests, I developed high-fidelity screens in Figma, ensuring a more refined visual experience aligned with the platform's design system. I then conducted the handoff to developers, documenting components, spacings, colors, and interactive behaviors in detail.",
      "descImage": "/assets/cases/suflex-contagem/high-fidelity.png",
      "imageCaption": "High-fidelity screens, already reflecting a rebrand done in parallel by the marketing team during the project's execution."
    }
  },
  "resultName": "Results",
  "resultCaption": "I used tools like Google Analytics and Hotjar to monitor platform performance over the course of a quarter.",
  "results": {
    "outcome": {
      "resultIcon": "<BadgeCheck />",
      "resultTitle": "+18%",
      "resultDesc": "We observed an 18% increase in users who completed the skill tests, from 1,586 to 1,871 monthly completions."
    },
    "outcome-2": {
      "resultIcon": "<TabletSmartphone />",
      "resultTitle": "+23%",
      "resultDesc": "The app saw a 23% growth in downloads, increasing from 871 to 1,071 new users in the quarter after implementation."
    },
    "outcome-3": {
      "resultIcon": "<CircleArrowOutDownRight />",
      "resultTitle": "-13%",
      "resultDesc": "The abandonment rate during skill tests decreased by 13%, from 7.38% to 6.42%."
    }
  }
}