{
  "id": "08",
  "privateCase": false,
  "caseType": "case",
  "slug": "construction-partner-quiz-experience-redesign",
  "title": "Redesigning the User Experience for the Quiz Feature",
  "subtitle": "Parceiro da Construção is a startup from the Saint-Gobain group that offers free online training for construction professionals. Available on Android, iOS, and web platforms, the product aims to educate and certify workers, expanding their opportunities in the job market.",
  "company": "Diwe",
  "myrole": "As a Product Designer, I was responsible for leading the entire research and data analysis process, identifying key barriers in the user experience. I created solution prototypes, conducted usability tests, and analyzed metrics to validate the improvements made. I worked closely with the product and development teams to ensure that the changes were effective, always focusing on improving the mobile experience and reducing abandonment rates in skill tests.",
  "timeFrame": "2 weeks (2022)",
  "plataform": "App (Android and iOS)",
  "researchMethods": "Double Diamond: Understand abandonment rates; Define the problem, metrics, and how it will be measured; Develop a solution; Delivery (Test and refinement).",
  "tools": "Miro, Notion, Hotjar, Google Analytics, Figma, Maze.",
  "teamStructure": "Product: Ramon Sousa (PD) and Lais Sousa (PM), Developers: Vinicius Bassalobre and Jessé",
  "publishedAt": [
    "2022"
  ],
  "thumbnail": "/assets/cases/pdc/cover-test-pdc.png",
  "banner": "/assets/cases/pdc/banner-highlights.png",
  "bannerHighlight": "/assets/cases/pdc/before-after.png",
  "tags": [
    "Product Led Growth",
    "User experience"
  ],
  "problemName": "Motivations",
  "problemCaption": "Problem Statement: Despite the numerous usability issues identified on the platform, our users showed significant value in skill tests, evidenced by high completion rates and frequent access to the flow. However, the difficulties faced during navigation compromised the overall experience and led users to disengage from the platform.",
  "goals": [
    "Increase the number of mobile app downloads.",
    "Reduce abandonment rate in started tests.",
    "Improve user experience in tests."
  ],
  "description": {
    "paragraph": {
      "descTitle": "Research and Data Collection",
      "descText": "Using tools like Hotjar and Google Analytics, we analyzed user behavior and identified the main barriers. We observed high abandonment rates in skill tests, especially for mobile users.",
      "descImage": "/assets/cases/pdc/insights.png",
      "imageCaption": "Interviews with users and heatmap analysis helped map friction points and navigability issues."
    },
    "paragraph-2": {
      "descTitle": "Relevant Persona",
      "descText": "The 'Applicators' persona was the most relevant for business goals, representing a large portion of our user base. They played a crucial role in future platform monetization strategies, becoming essential for the product's growth toward breakeven.",
      "descImage": "/assets/cases/pdc/personas.png",
      "imageCaption": ""
    },
    "paragraph-3": {
      "descTitle": "Performance Indicator",
      "descText": "I analyzed the frequency with which users accessed Parceiro da Construção in periods before improvements in skill tests. I also evaluated whether there was an increase in certificate issuance after the introduction of these tests.",
      "descImage": "/assets/cases/pdc/perfomance.png",
      "imageCaption": "Data from the period prior to the discovery process."
    },
    "paragraph-4": {
      "descTitle": "Wireframe and Test Plan",
      "descText": "For usability testing, I developed wireframes that addressed key tasks users should perform. The script included actions such as finding the new course page, locating ongoing tests, navigating between available categories, and reporting an error in a specific question. Additionally, users were encouraged to evaluate the relevance of the proposed 'Challenges' and share their results after completing a test.",
      "descImage": "/assets/cases/pdc/wireframe.png",
      "imageCaption": "Wireframe used in the first usability test. It is important to note the 'Tabs' navigation, which was discarded after the test (This was replicated in other flows being developed simultaneously)."
    },
    "paragraph-5": {
      "descTitle": "Usability Testing",
      "descText": "I conducted two versions of usability tests. In the first version, a group of five users, representing the defined personas, encountered difficulties in several stages of the test. Based on this feedback, I implemented improvements and conducted a new test, involving both new users and some participants from the first version.",
      "descImage": "/assets/cases/pdc/persona-usabillity-test.png",
      "imageCaption": "Key insights collected after conducting the usability test with the 'Applicator' persona users."
    },
    "paragraph-6": {
      "descTitle": "High Fidelity and Handoff",
      "descText": "After validating the wireframes and usability tests, I developed high-fidelity screens in Figma, ensuring a more refined visual experience aligned with the platform's design system. I then handed off the designs to the developers, documenting the components, spacings, colors, and interactive behaviors in detail.",
      "descImage": "/assets/cases/pdc/high-fidelity.png",
      "imageCaption": "High-fidelity screens, already incorporating a rebrand done in parallel by the marketing team during the project execution."
    }
  },
  "resultName": "Results",
  "resultCaption": "I used tools like Google Analytics and Hotjar to monitor platform performance over a three-month period.",
  "results": {
    "outcome": {
      "resultIcon": "<BadgeCheck />",
      "resultTitle": "+18%",
      "resultDesc": "We observed an 18% increase in the number of users who completed the skill tests, rising from 1,586 to 1,871 monthly completions."
    },
    "outcome-2": {
      "resultIcon": "<TabletSmartphone />",
      "resultTitle": "+23%",
      "resultDesc": "The app recorded a 23% growth in downloads, increasing from 871 to 1,071 new users in the quarter after implementation."
    },
    "outcome-3": {
      "resultIcon": "<CircleArrowOutDownRight />",
      "resultTitle": "-13%",
      "resultDesc": "The abandonment rate during skill test execution decreased by 13%, from 7.38% to 6.42%."
    }
  }
}